verification/runs/F14-cooling-ladder/K2b_runs/K2bP_URelax/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// cells: 46400   cell size 0.0125 m   blocks 11
scale   1;

vertices
(
    (0.000000 0.000000 0.000000)   // 0
    (0.000000 0.600000 0.000000)   // 1
    (0.000000 1.200000 0.000000)   // 2
    (0.000000 2.300000 0.000000)   // 3
    (0.000000 2.600000 0.000000)   // 4
    (0.000000 3.200000 0.000000)   // 5
    (0.000000 3.500000 0.000000)   // 6
    (0.000000 0.000000 2.000000)   // 7
    (0.000000 0.600000 2.000000)   // 8
    (0.000000 1.200000 2.000000)   // 9
    (0.000000 2.300000 2.000000)   // 10
    (0.000000 2.600000 2.000000)   // 11
    (0.000000 3.200000 2.000000)   // 12
    (0.000000 3.500000 2.000000)   // 13
    (0.000000 0.000000 2.700000)   // 14
    (0.000000 0.600000 2.700000)   // 15
    (0.000000 1.200000 2.700000)   // 16
    (0.000000 2.300000 2.700000)   // 17
    (0.000000 2.600000 2.700000)   // 18
    (0.000000 3.200000 2.700000)   // 19
    (0.000000 3.500000 2.700000)   // 20
    (0.600000 0.000000 0.000000)   // 21
    (0.600000 0.600000 0.000000)   // 22
    (0.600000 1.200000 0.000000)   // 23
    (0.600000 2.300000 0.000000)   // 24
    (0.600000 2.600000 0.000000)   // 25
    (0.600000 3.200000 0.000000)   // 26
    (0.600000 3.500000 0.000000)   // 27
    (0.600000 0.000000 2.000000)   // 28
    (0.600000 0.600000 2.000000)   // 29
    (0.600000 1.200000 2.000000)   // 30
    (0.600000 2.300000 2.000000)   // 31
    (0.600000 2.600000 2.000000)   // 32
    (0.600000 3.200000 2.000000)   // 33
    (0.600000 3.500000 2.000000)   // 34
    (0.600000 0.000000 2.700000)   // 35
    (0.600000 0.600000 2.700000)   // 36
    (0.600000 1.200000 2.700000)   // 37
    (0.600000 2.300000 2.700000)   // 38
    (0.600000 2.600000 2.700000)   // 39
    (0.600000 3.200000 2.700000)   // 40
    (0.600000 3.500000 2.700000)   // 41
);

blocks
(
    hex (0 21 22 1 7 28 29 8) (1 48 160) simpleGrading (1 1 1)
    hex (1 22 23 2 8 29 30 9) (1 48 160) simpleGrading (1 1 1)
    hex (3 24 25 4 10 31 32 11) (1 24 160) simpleGrading (1 1 1)
    hex (4 25 26 5 11 32 33 12) (1 48 160) simpleGrading (1 1 1)
    hex (5 26 27 6 12 33 34 13) (1 24 160) simpleGrading (1 1 1)
    hex (7 28 29 8 14 35 36 15) (1 48 56) simpleGrading (1 1 1)
    hex (8 29 30 9 15 36 37 16) (1 48 56) simpleGrading (1 1 1)
    hex (9 30 31 10 16 37 38 17) (1 88 56) simpleGrading (1 1 1)
    hex (10 31 32 11 17 38 39 18) (1 24 56) simpleGrading (1 1 1)
    hex (11 32 33 12 18 39 40 19) (1 48 56) simpleGrading (1 1 1)
    hex (12 33 34 13 19 40 41 20) (1 24 56) simpleGrading (1 1 1)
);

edges();

boundary
(
    floor
    {
        type wall;
        faces
        (
            (0 1 22 21)
            (3 4 25 24)
            (4 5 26 25)
            (5 6 27 26)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (14 35 36 15)
            (15 36 37 16)
            (16 37 38 17)
            (17 38 39 18)
            (19 40 41 20)
        );
    }
    wall_cold
    {
        type wall;
        faces
        (
            (0 21 28 7)
            (7 28 35 14)
        );
    }
    wall_hot
    {
        type wall;
        faces
        (
            (6 13 34 27)
            (13 20 41 34)
        );
    }
    rack_top
    {
        type wall;
        faces
        (
            (9 10 31 30)
        );
    }
    tile
    {
        type patch;
        faces
        (
            (1 2 23 22)
        );
    }
    return
    {
        type patch;
        faces
        (
            (18 39 40 19)
        );
    }
    rack_in
    {
        type patch;
        faces
        (
            (2 9 30 23)
        );
    }
    rack_out
    {
        type patch;
        faces
        (
            (3 24 31 10)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 7 8 1)
            (21 22 29 28)
            (1 8 9 2)
            (22 23 30 29)
            (3 10 11 4)
            (24 25 32 31)
            (4 11 12 5)
            (25 26 33 32)
            (5 12 13 6)
            (26 27 34 33)
            (7 14 15 8)
            (28 29 36 35)
            (8 15 16 9)
            (29 30 37 36)
            (9 16 17 10)
            (30 31 38 37)
            (10 17 18 11)
            (31 32 39 38)
            (11 18 19 12)
            (32 33 40 39)
            (12 19 20 13)
            (33 34 41 40)
        );
    }
);

// ************************************************************************* //
